Функция JSONВОбъект(СтрокаЧтения) Экспорт
	ЧтениеДанных = Новый ЧтениеJSON;
	ЧтениеДанных.УстановитьСтроку(СтрокаЧтения);
	Объект = ПрочитатьJSON(ЧтениеДанных);
	ЧтениеДанных.Закрыть();
	Возврат Объект;
КонецФункции

Функция ОтправитьЗаписьВЦентральнуюБазу(ДанныеДляОтправки) Экспорт
	
	ИмяСервера = "192.168.1.105";
	ПутьЗапроса = "/Avtoservis/hs/users/customerOrders";
	
	Соединение = Новый HTTPСоединение(ИмяСервера, , "Администратор", "");
	Запрос = Новый HTTPЗапрос(ПутьЗапроса);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеДляОтправки);
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON, "UTF-8");
	
	Попытка
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		
		Если Ответ.КодСостояния = 200 Тогда
			Возврат Истина;
		Иначе
			Сообщить("Сервер вернул ошибку: " + Ответ.ПолучитьТелоКакСтроку());
			Возврат Ложь;
		КонецЕсли;
	Исключение
		Сообщить("Сетевое исключение: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции
