Функция ВыполнитьАвторизацию(Логин) Экспорт
	
	ИмяСервера = "192.168.1.105";
	ПутьЗапроса = "/Avtoservis/hs/users/getUser?username=" + Логин;
	
	Соединение = Новый HTTPСоединение(ИмяСервера, , "Администратор", "");
	Запрос = Новый HTTPЗапрос(ПутьЗапроса);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		ДанныеССервера = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		
		УстановитьПривилегированныйРежим(Истина);
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ДанныеССервера.name);
		
		Если ПользовательИБ = Неопределено Тогда
			НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			НовыйПользовательИБ.Имя = ДанныеССервера.name;
			НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
			НовыйПользовательИБ.Записать();
		КонецЕсли;
		
		СсылкаНаПользователя = Справочники.Пользователи.НайтиПоНаименованию(ДанныеССервера.name);
		
		Если СсылкаНаПользователя.Пустая() Тогда
			ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();
			ОбъектПользователь.Наименование = ДанныеССервера.name;
			ОбъектПользователь.Код = ДанныеССервера.code;
			ОбъектПользователь.Записать();
			СсылкаНаПользователя = ОбъектПользователь.Ссылка;
		КонецЕсли;
		
		ПараметрыСеанса.ТекущийПользователь = СсылкаНаПользователя;
		
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Истина;
	Иначе
		Сообщить("Пользователь не найден в основной базе!");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция ВыполнитьРегистрацию(Логин, Телефон) Экспорт
	
	ИмяСервера = "192.168.1.105";
	ПутьЗапроса = "/Avtoservis/hs/users/register?username=" + Логин + "&phone=" + Телефон;
	
	Соединение = Новый HTTPСоединение(ИмяСервера, , "Администратор", "");
	Запрос = Новый HTTPЗапрос(ПутьЗапроса);
	
	Ответ = Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		ДанныеССервера = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		
		УстановитьПривилегированныйРежим(Истина);
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(ДанныеССервера.name);
		
		Если ПользовательИБ = Неопределено Тогда
			НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
			НовыйПользовательИБ.Имя = ДанныеССервера.name;
			НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
			НовыйПользовательИБ.Записать();
		КонецЕсли;
		
		СсылкаНаПользователя = Справочники.Пользователи.НайтиПоНаименованию(ДанныеССервера.name);
		
		Если СсылкаНаПользователя.Пустая() Тогда
			ОбъектПользователь = Справочники.Пользователи.СоздатьЭлемент();
			ОбъектПользователь.Наименование = ДанныеССервера.name;
			ОбъектПользователь.Код = ДанныеССервера.code;
			ОбъектПользователь.Записать();
			СсылкаНаПользователя = ОбъектПользователь.Ссылка;
		КонецЕсли;
		
		ПараметрыСеанса.ТекущийПользователь = СсылкаНаПользователя;
		
		УстановитьПривилегированныйРежим(Ложь);
		Возврат Истина;
	Иначе
		Сообщить("Не удалось зарегистрировать!");
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


Процедура Разлогиниться() Экспорт

Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда
	ПользователиИнформационнойБазы.ТекущийПользователь().Удалить();
КонецЕсли;

КонецПроцедуры 





