&НаСервере
Процедура УслугиУслугаПриИзмененииНаСервере(ИдентификаторСтроки)
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокаТЧ.Количество = 1;
	
	СтрокаТЧ.Сумма = СтрокаТЧ.Услуга.Стоимость * СтрокаТЧ.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	
	Строка = Элементы.Услуги.ТекущиеДанные;
	
	УслугиУслугаПриИзмененииНаСервере(Строка.ПолучитьИдентификатор());
	
	Объект.ОбщаяСтоимость = Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Процедура УслугиКоличествоПриИзмененииНаСервере(ИдентификаторСтроки)
	
	СтрокаТЧ = Объект.Услуги.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Услуга.Стоимость;
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	Строка = Элементы.Услуги.ТекущиеДанные;
	
	УслугиКоличествоПриИзмененииНаСервере(Строка.ПолучитьИдентификатор());
	
	Объект.ОбщаяСтоимость = Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСуммаПриИзменении(Элемент)
	
	Объект.ОбщаяСтоимость = Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьсяНаСервере()
	
	ТекущийЛогин = ИмяПользователя();
	МобильныйПользователь = Справочники.Пользователи.НайтиПоНаименованию(ТекущийЛогин, Истина);
	
	Если МобильныйПользователь.Пустая() Тогда
		МобильныйПользователь = Справочники.Пользователи.НайтиПоНаименованию("тест 10", Истина);
	КонецЕсли;
	
	СтруктураРеквизитов = Новый Структура;
	СтруктураРеквизитов.Вставить("ДатаЗаписи", Формат(Объект.ДатаЗаписи, "ДФ=yyyy-MM-ddTHH:mm:ss"));
	СтруктураРеквизитов.Вставить("Сотрудник", Строка(Объект.Сотрудник));
	СтруктураРеквизитов.Вставить("GUIDПользователя", МобильныйПользователь.Код);
	
	МассивУслуг = Новый Массив;
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		УслугаСтруктура = Новый Структура;
		УслугаСтруктура.Вставить("Услуга", Строка(СтрокаТЧ.Услуга));
		УслугаСтруктура.Вставить("Стоимость", Строка(СтрокаТЧ.Сумма));
		УслугаСтруктура.Вставить("Количество", Строка(СтрокаТЧ.Количество));
		МассивУслуг.Добавить(УслугаСтруктура);
	КонецЦикла;
	
	СтруктураРеквизитов.Вставить("МассивУслуг", МассивУслуг);
	
	ДокументУспешноОтправлен = ОбменСОсновнойБазой.ОтправитьЗаписьВЦентральнуюБазу(СтруктураРеквизитов);
	
	Если ДокументУспешноОтправлен Тогда
		
		ЛокальныйДокумент = Документы.ЗаписьКлиента.СоздатьДокумент();
		ЛокальныйДокумент.Дата = Объект.ДатаЗаписи;
		ЛокальныйДокумент.Сотрудник = Объект.Сотрудник;
		
		Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
			НоваяСтрокаДок = ЛокальныйДокумент.Услуги.Добавить();
			НоваяСтрокаДок.Услуга = СтрокаТЧ.Услуга;
			НоваяСтрокаДок.Стоимость = СтрокаТЧ.Сумма;
		КонецЦикла;
		
		Попытка
			ЛокальныйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЛокальныйДокумент.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
		Объект.ДатаЗаписи = '00010101';
		Объект.Сотрудник = Справочники.Сотрудники.ПустаяСсылка();
		Объект.Услуги.Очистить();
		Объект.ОбщаяСтоимость = 0;
		
		Возврат Истина;
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось отправить запись на сервер!";
		СообщениеПользователю.Сообщить();
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Записаться(Команда)
	
	Если ЗначениеЗаполнено(Объект.ДатаЗаписи) И Объект.ДатаЗаписи < ТекущаяДата() Тогда
		ПоказатьПредупреждение(, "Пожалуйста, измените дату записи. Запись на прошедшее время невозможна.");
		Возврат;
	КонецЕсли;
	
	СтрокаДата = Формат(Объект.ДатаЗаписи, "ДФ='dd.MM.yyyy HH:mm'");
	СтрокаУслуг = "";
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		СтрокаУслуг = СтрокаУслуг + ?(СтрокаУслуг = "", "", ", ") + СтрокаТЧ.Услуга;
	КонецЦикла;
	ФИОМастера = Строка(Объект.Сотрудник);
	
	Если ЗаписатьсяНаСервере() Тогда
		
		ТекстСообщения = "Вы записаны на услугу " + СтрокаУслуг + " к мастеру " + ФИОМастера + " на дату " + СтрокаДата;
		ПоказатьПредупреждение(, ТекстСообщения);
		
		ОткрытьФорму("Документ.ЗаписьКлиента.ФормаСписка");
		
	КонецЕсли;
	
КонецПроцедуры



